// Вивести числа від 20 до 30 через пропуск використовуючи крок 0,5 (20 20,5 21 21,5….)
let numList = '';
for (let i = 20; i <=30; i += 0.5) {
    numList += i + ',';
}
console.log(numList.slice(0,-1));



// Один долар коштує 40 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів
let dollar = 40;
for (i = 10; i <= 100; i += 10) { 
    console.log(`${i} долларів кошутє ${dollar * i} гривень`);
}



// Дано ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N
let num = Number(prompt('Введіть число N:'));
let numListTwo = '';
for (let i = 1; i <= 100; i++) {
    if (i * i < num) {
        console.log(i);
        numListTwo += i + ',';
    }
}
alert(numListTwo.slice(0, -1) + ' - це числа, квадрат яких не перевищує числа ' + num);



// Дано ціле число. З'ясувати, чи є воно простим (простим називається число, більше ніж 1, яке не має інших дільників крім 1 і себе)
// let a = Number(prompt('Введіть ціле число:'));
let a = Number(prompt('Введіть ціле число:'));

if (a <= 1) {
    alert(`${a} - не є простим числом.`);
} else {
    let isSimple = true;
    for (let i = 2; i < a; i++) {
        if (a % i === 0) {
            alert(`${a} - не є простим числом.`);
            isSimple = false;
            break;
        }
    }
    if (isSimple) {
        alert(`${a} - є простим числом.`);
    }
}



// Дано кілька. Визначити, чи можна одержати це число шляхом зведення числа 3 деякий ступінь. (Наприклад, числа 9, 81 можна отримати, а 13 - не можна)
let someNum = Number(prompt('Введіть число: '));
let res = 1;
const numThree = 3;

let isEqual = false;

for (let i = 0; res < someNum; i++) {
    res = Math.pow(numThree, i);
    if (res === someNum) {
        isEqual = true;
        break;
    }
}

if (isEqual) {
    alert('Можна одержати це число шляхом зведення числа 3 у деякий ступінь.');
} else {
    alert('Неможливо одержати це число шляхом зведення числа 3 у будь-який ступінь.');
}
